import random

from comm.common import slow_print


def huoqu_new_dideng(src_list, ret_list):
    word = random.choice(src_list)
    empty = random.randint(0, 3)
    new = word[:empty] + '( )' + word[empty + 1:]
    ret_list.append(word[empty])
    return new


def huoqu_new_zhongdeng(src_list, ret_list):
    word = random.choice(src_list)
    empty = random.randint(0, 3)
    empty2 = random.randint(0, 3)
    if empty == empty2:
        while True:
            empty2 = random.randint(0, 3)
            if empty != empty2:
                break
    if empty > empty2:
        temp = empty
        empty = empty2
        empty2 = temp
    new = word[:empty] + '( )' + word[empty + 1:empty2] + '( )' + word[empty2 + 1:]
    ret_list.append(word[empty])
    ret_list.append(word[empty2])
    return new


def huoqu_new_gaodeng(src_list, ret_list):
    word = random.choice(src_list)
    empty = random.randint(0, 3)
    empty2 = random.randint(0, 3)
    empty3 = random.randint(0, 3)
    if empty == empty2 or empty2 == empty3 or empty == empty3:
        while True:
            empty = random.randint(0, 3)
            empty2 = random.randint(0, 3)
            empty3 = random.randint(0, 3)
            if empty != empty2 and empty2 != empty3 and empty != empty3:
                break
    number_list = [empty, empty2, empty3]
    sorted_list = sorted(number_list)
    empty = sorted_list[0]
    empty2 = sorted_list[1]
    empty3 = sorted_list[2]
    new = word[:empty] + '( )' + word[empty + 1:empty2] + '( )' + word[empty2 + 1:empty3] + '( )' + word[empty3 + 1:]
    ret_list.append(word[empty])
    ret_list.append(word[empty2])
    ret_list.append(word[empty3])
    return new


def cheng_yu_tian_kong():
    src_list = ['铺天盖地', '心急如焚', '杯弓蛇影', '开卷有益', '随遇而安', '指鹿为马', '负荆请罪', '四面楚歌',
                '杯水车薪', '一叶知秋', '图穷匕见', '病入膏肓', '毛遂自荐', '邯郸学步', '杞人忧天', '画蛇添足',
                '守株待兔', '惊弓之鸟', '亡羊补牢', '自相矛盾', '难兄难弟', '狐假虎威', '刻舟求剑', '东施效颦',
                '自欺欺人', '张冠李戴', '不知所云', '乘风破浪', '瓜田李下', '指桑骂槐', '本末倒置', '提纲挈领',
                '请君入瓮', '约法三章', '狡兔三窟', '将计就计', '平易近人', '宽宏大度', '冰清玉洁', '持之以恒',
                '锲而不舍', '废寝忘食', '大义凛然', '临危不俱', '光明磊落', '不屈不挠', '鞠躬尽瘁', '死而后已',
                '恩重如山', '深情厚谊', '手足情深', '形影不离', '血浓于水', '志同道合', '风雨同舟', '赤诚相待',
                '肝胆相照', '生死相依', '无懈可击', '锐不可当', '雷厉风行', '震耳欲聋', '惊心动魄', '铺天盖地',
                '势如破竹', '气贯长虹', '万马奔腾', '如履平地', '循序渐进', '日积月累', '温故知新', '勤能补拙',
                '笨鸟先飞', '学无止境', '学海无涯', '滴水穿石', '发奋图强', '美不胜收', '蔚为壮观', '富丽堂皇',
                '金碧辉煌', '玉宇琼楼', '美妙绝伦', '巧夺天工', '锦上添花', '粉妆玉砌', '别有洞天', '万象更新',
                '抱头鼠窜', '螳臂挡车', '名不正则言不顺', '兵在精而不在多', '皇天不负有心人', '新官上任三把火',
                '强将手下无弱兵', '磨刀不误砍柴工', '朝里无人莫做官', '初生牛犊不怕虎', '识时务者为俊杰',
                '无事不登三宝殿', '一寸光阴一寸金', '跳进黄河洗不清', '古今中外', '名垂青史', '司空见惯', '百步穿杨',
                '一呼百应', '生搬硬套', '见利忘义', '力不从心', '如鱼得水', '百折不挠', '不耻下问', '不可救药',
                '沧海桑田', '东山再起', '开门见山', '情同手足', '随波逐流', '有口难言', '价值连城', '纪群之交',
                '俭以养德', '俭以养廉', '蝍且甘带', '蝍蛆甘带', '辑志协力', '瘠己肥人', '瘠牛偾豚', '驾鹤成仙',
                '驾鹤西游', '驾肩接迹', '驾肩接武', '驾轻就熟', '驾轊连軏', '驾雾腾云', '假痴不癫', '假痴假呆',
                '简傲绝俗', '鸡毛蒜皮', '鸡鸣而起', '鸡鸣狗盗', '鸡鸣狗吠', '鸡鸣候旦', '鸡鸣戒旦', '鸡鸣起舞',
                '鸡鸣犬吠', '鸡鸣馌耕', '鸡鸣之助', '鸡皮疙瘩', '鸡皮疙疸', '鸡皮鹤发', '鸡栖凤巢', '鸡犬不安',
                '鸡犬不惊', '鸡犬不留', '鸡犬不宁', '鸡犬不闻', '鸡犬皆仙', '鸡犬桑麻', '鸡犬升天', '鸡犬无惊',
                '鸡犬相闻', '鸡鹜争食', '鸡胸龟背', '鸡争鹅斗', '咭噔咯噔', '咭咭嘎嘎', '咭咭格格', '咭咭刮刮',
                '咭咭呱呱', '咭咭咯咯', '咭咭哝哝', '咭喱咕哝', '咭力骨碌', '咭咧呱啦', '咭溜搭剌', '积衰新造',
                '积水成渊', '积思广益', '积苏累块', '积素累旧', '积岁累月', '积土成山', '积土为山，积水为海', '积微成着',
                '积微致着', '积习成常', '积习成俗', '积习渐靡', '积习难除', '积习难改', '积习生常', '积习相沿',
                '积小成大', '积小致巨', '积薪厝火', '积薪候燎', '积羞成怒', '积雪封霜', '积雪囊萤', '积以为常',
                '积忧成疾', '积羽沉舟', '积玉堆金', '绩学之士', '犄角旮旯', '犄角之势', '犄里旯旮', '缉缉翩翩',
                '赍粮借寇', '赍志而没', '赍志而殁', '赍志没地', '吉人天相', '吉人自有天相', '吉日良辰', '吉日良时',
                '吉网罗钳', '吉祥如意', '吉祥止止', '吉星高照', '急拍繁弦', '急起直追', '急人所急', '急人之困',
                '急人之难', '急如风火', '急如星火', '急三火四',
                '急则计生', '急张拘诸', '急张拒遂', '急章拘诸', '急獐拘猪', '急征重敛', '急中生智', '急周各支',
                '急竹繁丝', '急转直下',
                '急嘴急舌', '疾首蹙额', '疾首蹙頞', '疾首嚬蹙', '疾首痛心', '纪纲人论', '茧丝牛毛', '疾言倨色',
                '疾言遽色', '疾言厉气',
                '疾言厉色', '疾言怒色', '疾雨暴风', '简忽所见', '简捷了当', '简截了当', '简练揣摩', '简落狐狸',
                '简明扼要', '简能而任',
                '简切了当', '简要不烦', '简要清通', '简约详核', '简在帝心', '简种薄收', '谫谫屑屑', '碱基配对',
                '謇谔之风', '謇谔之节',
                '謇谔自负', '謇謇谔谔', '僵李代桃', '僵仆烦愦', '僵桃代李', '讲呈说告', '讲若画一', '讲是说非',
                '吉凶祸福', '吉凶未卜',
                '岌岌不可终日', '岌岌可危', '汲古阁本', '汲汲波波', '汲汲顾影', '汲汲皇皇', '汲汲遑遑', '汲汲忙忙',
                '汲汲摇摇',
                '汲汲营营', '汲汲孜孜', '汲郡古文', '汲深绠短', '汲引忘疲', '汲冢古文', '即即世世', '即即足足',
                '即景生情', '既往不咎',
                '既有今日，何必当初', '既约分数', '济馋都护', '济寒赈贫', '济河焚舟', '济济彬彬', '济济斌斌', '济济楚楚',
                '济济促促',
                '济济荡荡', '寄兴寓情', '寄颜无所', '寄雁传书', '家贫亲老', '家贫如洗', '家破人离', '家破人亡',
                '家破身亡', '家散人亡',
                '架海金梁', '架谎凿空', '架肩击毂', '架肩接踵', '架屋迭床', '架屋叠床', '即温听厉', '即物穷理',
                '极愿尽欢', '极则必反',
                '急来报佛脚', '急吏缓民', '急敛暴征', '急流勇进', '急流勇退', '急留古鲁', '急留骨碌', '急脉缓灸',
                '急脉缓受',
                '疾之如仇', '疾之若仇', '疾走先得', '疾足先得', '棘围锁院', '煎膏炊骨', '煎胶续弦', '煎水作冰',
                '煎汤洗臀', '煎盐叠雪',
                '艰苦创业', '艰苦奋斗', '艰苦奋鬬', '艰苦朴素', '艰苦涩滞', '艰苦卓绝', '艰难竭蹶', '艰难困苦',
                '艰难曲折', '艰难时世',
                '艰难险阻', '艰难玉成', '艰深晦涩', '兼爱无私', '兼包并容', '兼包并畜', '兼程并进', '兼程前进',
                '兼而有之', '兼覆无遗',
                '兼功自厉', '兼官重绂', '兼葭秋水', '兼葭倚玉', '兼览博照', '江流日下', '江南海北', '挢抂过正',
                '挢揉造作', '挢枉过正',
                '焦眉愁眼', '焦眉苦脸', '焦眉皱眼', '进荣退辱', '进锐退速', '进鋭退速', '进善惩恶', '进善惩奸',
                '进善黜恶', '旌旗蔽空',
                '旌旗蔽日', '旌旗蔽天', '旌旗卷舒', '家鸡野鹜', '家鸡野雉', '家骥人璧', '家家户户', '家见户说',
                '交交关关', '交交牙牙',
                '交颈并头', '交口称誉', '交口称赞', '交口荐誉', '交口同声', '集矢之的', '集思广议', '集思广益',
                '集体财产', '集腋成裘',
                '集腋为裘', '集萤映雪', '集苑集枯', '集装箱船', '嫉恶好善', '嫉恶如仇', '嫉恶若仇', '瘠牛羸豚',
                '瘠人肥己', '瘠义肥辞',
                '鹡鸰在原', '蹐地局天', '蹐地跼天', '几不欲生', '几次三番', '己饥己溺', '己溺己饥', '己所不欲，勿施于人',
                '虮虱相吊',
                '挤挤插插', '挤眉溜眼', '挤眉弄眼', '挤手捏脚', '交口赞誉', '交梨火枣', '交詈聚唾', '继世而理',
                '继天立极', '继往开来',
                '继之以死', '继志述事', '继踵而至', '记功忘过', '记功忘失', '忌前之癖', '季路一言', '季孟之间',
                '济济哄哄', '济济排排',
                '济济漆漆', '济济跄跄', '济济锵锵', '济济师师', '济济洋洋', '济济一堂', '济济翼翼', '济苦怜贫',
                '济困扶危', '济南惨案',
                '济贫拔苦', '济窍飘风', '济人利物', '济弱锄强', '济弱扶倾', '假公济私', '假公营私', '假虎张威',
                '假阶救火', '假力于人',
                '假眉三道', '见鞍思马', '脚踏两只船', '脚踏实地', '街谈巷说', '街谈巷谚', '街谈巷议', '街谈巷语',
                '街谭巷议',
                '街头巷底', '街头巷尾', '街巷阡陌', '肩背难望', '肩背相望', '见危授命', '见危致命', '见微知萌',
                '见微知着',
                '见物不见人', '讲信修睦', '奖拔公心', '奖罚分明', '矫国革俗', '矫国更俗', '矫激奇诡', '矫矫不群',
                '讲文张字',
                '奬勤罚懒', '迦维罗越', '迦旃邻提', '迦真邻陀', '枷脰械手', '浃背汗流', '见贤不隐', '见贤思齐',
                '见小暗大', '见笑大方',
                '见性成佛', '见噎废食', '见义必为', '见义当为', '见义敢为', '见义勇为', '见异思迁', '见之不取，思之千里',
                '见制于人',
                '见智见仁', '蒹葭伊人', '蒹葭倚玉', '蒹葭倚玉树', '蒹葭之思', '肩劳任怨', '肩摩毂击', '肩摩毂接',
                '肩摩袂接',
                '肩摩踵接', '见财起意', '见经识经', '见精识精', '见景生情', '见可而进', '见可而进，知难而退', '见哭兴悲',
                '见棱见角',
                '见利思义', '见利忘危', '见利忘义', '见猎心喜', '见卵求鸡', '见貌辨色', '见貎辨色', '见溺不救',
                '见其一未见其二',
                '见弃于人', '见钱眼红', '见钱眼开', '见墙见羹', '见诮大方', '矫时慢物', '矫世变俗', '矫世厉俗',
                '矫世励俗', '矫饰伪行',
                '矫枉过当', '矫枉过正', '矫枉过直', '矫枉过中', '矫尾厉角', '矫邪归正', '矫心饰貌', '矫言伪行',
                '脚不点地', '脚不沾地',
                '脚高步低', '脚跟无线', '脚忙手乱', '居常虑变', '居常之安', '津关险塞', '津津乐道', '津津有味',
                '翦草除根', '翦爪断发',
                '僭赏滥刑', '槛花笼鹤', '槛猿笼鸟', '箭拔弩张', '箭不虚发', '箭穿雁嘴', '计过自讼', '计合谋从',
                '计获事足', '计将安出',
                '计较锱铢', '计尽力穷', '计穷力极', '计穷力竭', '计穷力尽', '计穷力诎', '计穷力屈', '计穷虑极',
                '计穷虑尽', '计穷势蹙',
                '计穷势迫', '计穷途拙', '计穷智短', '计穷智极', '计然之策', '计然之术', '计日程功', '计日而待',
                '计日而俟', '计日可待',
                '计日可期', '计日以待', '计日以期', '计日以俟', '计日指期', '计日奏功', '计上心来', '计上心头',
                '计深虑远', '佳人薄命',
                '佳人才子', '迦陵毗伽', '迦陵频伽', '迦罗婆劫', '迦罗沙曳', '降龙伏虎', '降心俯首', '降心顺俗',
                '降心下气', '降心相从',
                '加官进爵', '加官进禄', '加官晋爵', '加减乘除', '拣佛烧香', '拣精拣肥', '拣精择肥', '俭薄不充',
                '俭不中礼', '俭存奢失',
                '俭腹高谈', '俭故能广', '俭可养廉', '践冰履炭', '践规踏矩', '践律蹈礼', '践墨随敌', '践土食毛',
                '交横绸缪', '加人一等',
                '夹辅之勋', '夹击分势', '夹七夹八', '夹枪带棒', '夹枪带棍', '夹叙夹议', '夹纸灯笼', '佳兵不祥',
                '佳儿佳妇', '浃沦肌髓',
                '浃髓沦肤', '浃髓沦肌', '家败人亡', '家半三军', '家藏户有', '家长礼短', '家长里短', '家常便饭',
                '家常茶饭', '家常里短',
                '家成业就', '家丑不可外谈', '家丑不可外扬', '家传户诵', '家传户颂', '家传人诵', '家大业大', '家道壁立',
                '家道从容',
                '家道消乏', '家道小康', '家道中落', '家翻宅乱', '家烦宅乱', '家反宅乱', '家给民足', '家给人足',
                '家势中落',
                '家书抵万金', '家塾刻本', '葭莩之亲', '葭莩之情', '甲第连天', '甲第连云', '甲冠天下', '贾虎荀龙',
                '贾马服郑',
                '贾马许郑', '贾女私窥', '假慈悲', '假道灭虢', '假门假氏', '假门假事', '假名托姓', '假模假式',
                '假气游魂', '假情假意',
                '假热佯亲', '假人辞色', '假人假义', '假仁假义', '假仁假意', '假仁纵敌', '假手旁人', '假手于人',
                '假天假地', '假途灭虢',
                '坚白相盈', '坚壁不战', '坚壁清野', '坚不可摧', '坚持不懈', '坚持不渝', '坚定不移', '坚额健舌',
                '坚瓠无窍', '坚甲厉兵',
                '坚甲利兵', '坚甲利刃', '坚苦卓绝', '坚明约束', '坚强不屈', '坚忍不拔', '坚忍质直', '坚韧不拔',
                '坚如盘石', '坚如磐石',
                '坚守不渝', '坚卧烟霞', '坚心守志', '坚贞不屈', '坚贞不渝', '坚执不从', '肩从齿序', '肩负重任',
                '兼年之储', '兼权尚计',
                '兼权熟计', '兼人好胜', '兼人之材', '兼人之量', '兼人之勇', '兼容并包', '兼容并蓄', '兼弱攻昧',
                '兼善天下', '兼收并采',
                '兼收并录', '兼收并録', '兼收并畜', '兼收并蓄', '兼收博采', '兼听则明，偏信则暗', '监临自盗', '监门之养',
                '监市履狶',
                '渐仁摩义', '渐入佳境', '渐至佳境', '谏鼓谤木', '谏尸谤屠', '解粘去缚', '结结巴巴', '结结实实',
                '结舌杜口', '结舌钳口',
                '解纷排难', '解甲倒戈', '解甲归田', '解甲投戈', '解甲休兵', '九合一匡', '居不择邻', '居不重席',
                '居不重茵', '近亲繁殖',
                '近水楼台', '近水楼台先得月', '近水惜水', '监守自盗', '监主自盗', '湔肠伐胃', '简而言之', '简纲捷端',
                '箭无空发',
                '箭无虚发', '箭在弦上', '江东父老', '江翻海倒', '江翻海沸', '江翻海搅', '江翻海扰', '胶胶扰扰',
                '胶柱调瑟', '胶柱鼓瑟',
                '劫制天下', '诘究本末', '诘曲聱牙', '诘诎聱牙', '诘屈磝碻', '诘屈聱牙', '诘屈謷牙', '诘戎治兵',
                '洁己从公', '洁己奉公',
                '洁清不洿', '洁清自矢', '洁身累行', '洁身守道', '洁身自爱', '洁身自好', '洁身自守', '搅肚蛆肠',
                '搅海翻江', '搅七念三',
                '剿抚兼施', '孑然无依', '孑然一身', '节哀顺变', '节变岁移', '竞短争长', '竞今疏古', '剑拔弩张',
                '剑胆琴心', '剑腹饴唇',
                '剑及屦及', '剑及履及', '剑戟森森', '角弓反张', '角户分门', '靖康之变', '精白之心', '精兵简政',
                '精兵猛将', '精兵强将',
                '精采秀发', '精彩逼人', '精诚贯日', '精诚所至', '精诚所至，金石为开', '精诚团结', '精赤条条', '精唇泼口',
                '精打细算',
                '精雕细刻', '精雕细镂', '精耕细作', '精神恍惚', '精神满腹', '精卫填海', '精细入微', '精心励志',
                '敬终慎始', '靓妆炫服',
                '靓妆艳服', '静言令色', '静言庸违', '镜里采花', '镜里恩情', '镜里观花', '镜破钗分', '镜台自献',
                '旧事重提', '旧态复萌',
                '江湖骗子', '较长絜短', '较德焯勤', '较短比长', '较短量长', '较短絜长', '较如画一', '较若画一',
                '较瘦量肥', '较武论文',
                '骄兵必败', '骄兵之计', '骄侈暴佚', '骄侈淫虐', '骄儿騃女', '骄佚奢淫', '教猱升木', '金声玉润',
                '金声玉色', '金声玉振',
                '金声掷地', '进退两端', '进退两难', '进退路穷', '进退履绳', '进退荣辱', '进退失措', '进退失据',
                '进退失踞', '进退失所',
                '进退失图', '进退首鼠', '进退双难', '进退损益', '进退亡据', '进退为难', '进退唯谷', '进退惟谷',
                '进退惟咎', '进退维谷',
                '进退维亟', '进退维艰', '进退无措', '将欲取之，必先与之', '将遇良才', '将遇良材', '浆酒霍肉', '浆酒藿肉',
                '浆水不交',
                '匠门弃材', '匠石运金', '匠心独具', '匠心独妙', '匠心独运', '匠遇作家', '弜头虎子', '降本流末',
                '交洽无嫌', '金辉玉洁',
                '金徽玉轸', '金鸡宝帐', '金鸡步帐', '金鸡独立', '金鸡放赦', '金鸡纳树', '金鸡纳霜', '金鸡消息',
                '金齑玉脍', '金齑玉鲙',
                '金虀玉鲙', '金枷玉锁', '僸佅兜离', '噤口卷舌', '噤若寒蝉', '矜牙舞爪', '矜愚饰智', '矜智负能',
                '筋疲力敝', '筋疲力竭',
                '筋疲力尽', '筋疲力倦', '筋信骨强', '襟怀磊落', '襟怀洒落', '襟怀坦白', '襟江带湖', '襟裾马牛',
                '仅此而已', '仅容旋马',
                '仅识之无', '仅以身免', '脚心朝天', '脚丫朝天', '节短韵长', '节俭躬行', '节俭力行', '节节败退',
                '节节寸寸', '节节排排',
                '节节胜利', '渐不可长', '鉴机识变', '鉴空衡平', '鉴毛辨色', '鉴貌辨色', '鉴前毖后', '鉴往知来',
                '鉴影度形',
                '江海不逆小流', '江海同归', '江海之士', '江汉朝宗', '江河日下', '江河行地', '焦熬投石', '金紫银青',
                '金字招牌',
                '矜才使气', '矜持不苟', '惊心悲魄', '惊心惨目', '惊心褫魄', '惊心怵目', '惊心悼胆', '惊心吊胆',
                '惊心吊魄', '惊心动魄',
                '惊心夺目', '惊心骇目', '惊心骇神', '惊心骇瞩', '惊心裂胆', '惊心破胆', '惊心丧魄', '惊心眩目',
                '惊愚骇俗', '惊猿脱兔',
                '酒瓮饭囊', '酒酽花浓', '酒有别肠', '酒有别膓', '酒余茶后', '酒余饭饱', '酒足饭饱', '酒醉饭饱',
                '酒醉酒解', '旧爱宿恩',
                '久役之士', '久战沙场', '久蛰思启', '久坐地厚', '灸艾分痛', '拘挛补衲', '拘挛之见', '拘奇抉异',
                '江郎才尽', '江郎才掩',
                '阶柳庭花', '阶前万里', '阶下囚', '静极思动', '禁暴静乱', '禁暴正乱', '禁暴诛乱', '禁鼎一脔',
                '禁攻寝兵', '江山半壁',
                '江山不老', '江山好改，本性难移', '江山好改，秉性难移', '江山如故', '江山如画', '江山如旧',
                '江山易改，本性难移',
                '江山易改，秉性难移', '江山易改，禀性难移', '江山之恨', '江山之异', '江山之助', '江水不犯河水',
                '江天一色', '江西诗派',
                '江夏八俊', '江心补漏', '江淹才尽', '江淹梦笔', '江洋大盗', '江云渭树', '江左夷吾', '姜桂之性',
                '姜太公钓鱼，愿者上钩',
                '将本求财', '将本求利', '将本图利', '将伯之呼', '将伯之助', '将错就错', '将夺固与', '将飞翼伏',
                '将废姑兴', '将奋足局',
                '将高就低', '将功补过', '将功抵罪', '将功赎罪', '将功折过', '将功折罪', '将机就机', '将机就计',
                '将计就计', '将恐将惧',
                '将李代桃', '将门虎子', '将门无犬子', '将门有将', '将明之材', '将勤补拙', '将取固予', '将噬爪缩',
                '将顺匡救',
                '将顺其美', '将天就地', '将无作有', '将无做有', '将虾钓鳖', '将相之器', '将心比心', '将信将疑',
                '将胸比肚', '将勇兵强',
                '将勇兵雄', '交浅言深', '交疏吐诚', '交头互耳', '交头接耳', '交相辉映', '郊寒岛瘦', '娇嗔满面',
                '娇娇滴滴', '娇鸾雏凤',
                '娇皮嫩肉', '娇揉造作', '娇生惯养', '娇声娇气', '娇小玲珑', '浇淳散朴', '浇醇散朴', '浇风薄俗',
                '浇瓜之惠', '骄傲自大',
                '骄傲自满', '胶东大鼓', '胶鬲之困', '胶胶膊膊', '胶胶纷纷', '胶胶角角', '椒房兰室', '椒焚桂折',
                '椒鹤文石', '椒花丽句',
                '椒举班荆', '焦唇敝舌', '焦唇干肺', '焦唇干舌', '焦金流石', '焦金烁石', '兢兢干干', '兢兢业业',
                '兢兢翼翼', '兢兢战战',
                '节衣素食', '节衣缩食', '节用爱民', '节用裕民', '节制之师', '节中长节', '咎由自取', '咎有应得',
                '疚心疾首', '精忠报国',
                '驹齿未落', '驹窗电逝', '驹光过隙', '解发佯狂', '皆大欢喜', '接不上茬', '接长不短', '接耳交头',
                '接二连三', '接风洗尘',
                '结不解缘', '结草衔环', '结草之固', '结党连群', '结党营私', '结发夫妻', '进种善群', '晋惠闻蛙',
                '晋阳之甲', '晋用楚材',
                '祲威盛容', '缙绅便览', '寖昌寖炽', '焦沙烂石', '焦思苦虑', '焦头烂额', '焦尾枯桐', '焦心劳思',
                '焦心热中', '焦躁不安',
                '蛟龙擘水', '蛟龙得水', '蛟龙得雨', '蛟龙失水', '蛟龙戏水', '蛟龙玉匣', '蕉鹿之梦', '燋金烁石',
                '燋龙温池', '燋头烂额',
                '鹪巢蚊睫', '鹪鹩一枝', '靖言庸回', '靖言庸违', '靖谮庸回', '节威反文', '解衣槃磅', '解衣磐礴',
                '解衣推食', '解衣卸甲',
                '解衣衣人', '解疑释惑', '解组归田', '揭地掀天', '揭竿而起', '揭竿四起', '揭鸡肆赦', '揭揭巍巍',
                '揭箧担囊', '揭箧探囊',
                '揭人之短', '揭债还债', '街道巷陌', '街坊邻居', '街坊邻里', '街坊邻舍', '街坊四邻', '街号巷哭',
                '教导有方',
                '教妇初来，教儿婴孩', '解铃还是系铃人', '解铃还须系铃人', '解铃还需系铃人', '解铃系铃', '解铃须用系铃人',
                '解民倒悬',
                '解囊相助', '解黏去缚', '解巾从仕', '进思尽忠，退思补过', '进退跋疐', '进退出处', '进退触藩', '进退触籓',
                '进退触篱',
                '进退存亡', '进退狐疑', '进退可度', '进退可否', '进退狼狈', '惊涛巨浪', '惊涛怒浪', '惊天动地',
                '惊喜交集', '惊喜交加',
                '惊喜若狂', '惊喜欲狂', '惊弦之鸟', '精义入神', '精益求精', '静因之道', '静影沉璧', '静中思动',
                '局外之人', '菊老荷枯',
                '糠豆不瞻', '刻舟求剑', '刻烛成诗', '钧天广乐', '钧折行仓', '皲手茧足', '金玦衣厖', '金科玉律',
                '金科玉臬', '金科玉条',
                '金科玉篆', '金口木舌', '金口玉牙', '金口玉言', '金口玉音', '金口御言', '金块珠砾', '金匮石室',
                '今蝉蜕殻',
                '今朝有酒今朝醉', '今愁古恨', '今非昔比', '今古奇观', '今来古往', '今日有酒今日醉', '口钳舌卷',
                '口巧手拙', '口茄目瞠',
                '口轻舌薄', '口呿眸眙', '口如悬河', '口若悬河', '口尚乳臭', '刳兽食胎', '刳胎焚郊', '刳胎焚夭',
                '刳胎杀夭', '刳心雕肾', '刳形去皮', '刳脂剔膏', '刳舟剡楫', '枯本竭源', '恪勤匪懈', '尽诚竭节',
                '尽辞而死',
                '尽瘁鞠躬', '尽瘁事国', '尽多尽少', '尽付东流', '尽欢而散', '尽欢竭忠', '经体赞元', '经天纬地',
                '经纬天地', '经纬天下',
                '经纬万端', '经文纬武', '经武纬文', '开阔眼界', '开来继往', '开利除害', '科头裸身', '科头袒体',
                '科头徒跣', '科头细粉',
                '科头跣足', '金兰契友', '金兰小谱', '金兰之交', '金兰之契', '金兰之友', '教无常师', '教学相长',
                '教一识百', '教亦多术',
                '金刚努目', '金刚怒目', '金刚眼睛', '金戈铁甲', '金戈铁马', '金戈铁骑', '金谷酒数', '金鼓连天',
                '金鼓齐鸣', '金鼓喧阗',
                '金光灿烂', '尽节竭诚', '尽节死敌', '尽力而为', '尽美尽善', '尽其所长', '尽其所能', '尽其在我',
                '尽情尽理', '尽人皆知',
                '尽日极虑', '尽日穷夜', '尽如人意', '尽如所期', '尽入彀中', '尽锐出战', '尽善尽美', '尽室以行',
                '尽释前嫌', '尽收眼底',
                '尽思极心', '九鼎不足为重', '九鼎大吕', '谨谨慎慎', '谨毛失貌', '谨能胜祸', '谨身节用', '谨慎从事',
                '谨慎小心',
                '谨始虑终', '斠然一概', '斠若画一', '噍类无遗', '禁奸除猾', '截铁斩钉', '截辕杜辔', '截趾适屦',
                '截趾适履', '竭诚尽节',
                '竭诚相待', '竭诚以待', '竭尽全力', '竭尽心力', '竭力尽能', '竭力虔心', '竭心尽意', '竭泽而鱼',
                '竭泽而渔', '竭泽焚薮',
                '竭智尽力', '竭智尽忠', '竭忠尽节', '竭忠尽智', '羯鼓催花', '羯鼓解秽', '解兵释甲', '解骖推食',
                '旧景泼皮', '旧念复萌',
                '旧瓶新酒', '旧瓶装新酒', '旧荣新辱', '旧时风味', '旧识新交', '接贵攀高', '接景摄影', '浸明浸昌',
                '浸润之谮',
                '浸微浸灭', '浸微浸消', '精贯白日', '精悍短小', '精金百炼', '精金良玉', '精金美玉', '精进不休',
                '精进勇猛', '静不露机',
                '静如处女，动如脱兔', '静若处子，动若脱兔', '金莲花炬', '近乡情怯', '近悦远来', '近在眉睫', '近在咫尺',
                '近朱近墨',
                '近朱者赤', '近朱者赤，近墨者黑', '进本退末', '角巾东第', '角巾东路', '角巾私第', '角立杰出', '角枪题注',
                '狡童之歌',
                '狡兔三窟', '狡兔三穴', '狡兔死，良狗烹', '狡兔死，良犬烹', '狡焉思逞', '狡焉思启', '狡焉思肆',
                '绞尽脑汁', '皎如日星',
                '皎阳似火', '介山之志', '金粟莲台', '金粟如来', '金台市骏', '金台夕照', '金汤之固', '金淘沙拣',
                '金题玉躞', '进利除害',
                '进禄加官', '进旅退旅', '进履之书', '进门女婿', '进壤广地', '劫富济贫', '劫富救贫', '劫后余生',
                '劫劫巴巴', '劫数难逃',
                '叫化子', '叫苦不迭', '叫苦连天', '叫天吖地', '驹留空谷', '痀偻承蜩', '椐椐强强', '趄趄趔趔',
                '裾马襟牛', '裾状下摆',
                '捷报频传', '捷径窘步', '捷雷不及掩耳', '捷足先得', '捷足先登', '颉地颃空', '截长补短', '截镫留鞭',
                '截断众流',
                '截发剉稾', '截发锉藳', '截发留宾', '截鹤续凫', '截胫剖心', '截然不同', '接连不断', '接袂成帷',
                '接三连四', '接踵比肩',
                '接踵而来', '接踵而至', '嗟悔亡及', '嗟悔无及', '嗟来之食', '节上生枝', '节食省衣', '节食缩衣',
                '节同时异', '节外生枝',
                '洁言污行', '洁浊扬清', '结加趺坐', '结跏趺坐', '结绳而治', '结驷连镳', '结驷连骑', '结驷列骑',
                '结缨伏剑', '桀敖不驯',
                '桀傲不恭', '桀傲不驯', '桀骜不恭', '桀骜不驯', '桀骜不逊', '桀骜难驯', '桀骜自恃', '桀逆放恣',
                '桀犬吠尧', '桀贪骜诈',
                '桀黠擅恣', '今是昔非', '今是昨非', '今夕何夕', '今昔之感', '今雨新知', '今月古月', '斤车御史',
                '斤斤计较', '斤斤较量',
                '斤斤自守', '金鳌玉蝀', '金鳌玉栋', '金榜挂名', '金榜题名', '矜世取宠', '紧打慢敲', '紧箍咒',
                '紧急关头', '紧急状态',
                '紧锣密鼓', '紧三火四', '紧行无好步', '禁止令行', '禁中颇牧', '解人难得', '解事舍人', '解手尖刀',
                '解弦更张',
                '金珰大畹', '金貂换酒', '金貂取酒', '金貂贳酒', '金钉浮瓯', '金钉朱户', '金断觿决', '金粉豪华',
                '金粉南朝', '金风送爽',
                '金风玉露', '尽态极妍', '尽相穷形', '尽心而已', '尽心竭诚', '尽心竭力', '尽心尽力', '尽心图报',
                '尽心知性',
                '尽信书不如无书', '尽智竭力', '尽忠报国', '尽忠拂过', '尽忠竭力', '惊愕失色', '惊耳骇目', '惊风扯火',
                '惊风骇浪',
                '惊风怒涛', '惊弓之鸟', '惊鸿艳影', '惊慌失措', '惊慌失色', '惊慌无措', '惊皇失措', '惊惶不安',
                '惊惶失措', '惊惶失色',
                '惊惶万状', '惊惶无措', '惊魂不定', '惊魂动魄', '惊魂夺魄', '惊魂甫定', '惊魂落魄', '惊魂丧魄',
                '惊魂摄魄', '惊魂失魄',
                '惊魂未定', '惊悸不安', '惊见骇闻', '惊惊怍怍', '惊恐失措', '惊恐失色', '惊恐万状', '惊鸾回凤',
                '解颜而笑', '解衣般礴',
                '解衣磅礴', '解衣包火', '解衣抱火', '解衣盘磅', '解衣盘礴', '介胄之间', '戒备森严', '戒骄戒躁',
                '居官守法', '居敬穷理',
                '居利思义', '居穷守约', '居仁由义', '金人缄口', '金人三缄', '金人之缄', '金人之箴', '金沙银汞',
                '金舌弊口', '金舌蔽口',
                '金声玉服', '进退无据', '进退无路', '荆棘满途', '荆棘塞途', '荆棘铜驼', '荆棘载途', '荆人涉澭',
                '荆山之玉', '荆天棘地',
                '荆榛满目', '经国大业', '经国之才', '景升豚犬', '景星凤皇', '景星凤凰', '景星麟凤', '景星庆云',
                '憬然有悟', '硁硁之见',
                '硁硁之信', '硁硁之愚', '铿金霏玉', '铿金戛玉', '铿锵有力', '铿镪顿挫', '空谷之音', '空谷足音',
                '空国之侯', '九五之位',
                '九五之尊', '九锡宠臣', '九霄云外', '九行八业', '口血未干', '口吟舌言', '口壅若川', '口有同嗜',
                '口语籍籍', '口燥唇干',
                '康庄大道', '慷慨悲歌', '慷慨陈词', '慷慨赴义', '慷慨激昂', '慷慨激烈', '慷慨激扬', '慷慨解囊',
                '慷慨就义', '慷慨捐生',
                '慷慨淋漓', '慷慨输将', '慷慨仗义', '举国若狂', '举国上下', '举国一致', '举笏击蛇', '举酒作乐',
                '举例发凡', '举目皆是',
                '举目千里', '举目无亲', '举偏补弊', '举棋不定', '举棋若定', '举前曳踵', '举如鸿毛，取如拾遗', '举善荐贤',
                '举觞称庆',
                '举十知九', '就职视事', '戒奢宁俭', '戒奢以俭', '戒舟慈棹', '芥拾青紫', '芥子须弥', '界限量规',
                '疥癣之疾', '诫莫如豫',
                '诫莫若豫', '借词卸责', '借贷无门', '借刀杀人', '借端生事', '借风使船', '借公行私', '借古讽今',
                '借古喻今', '借故敲诈',
                '借故推辞', '借花献佛', '借剑杀人', '借交报仇', '借景生情', '借镜观形', '借酒浇愁', '借客报仇',
                '借寇赍盗', '借面吊丧',
                '借篷使风', '借坡下驴', '进退无门', '进退无所', '进退无途', '进退无依', '进退消长', '进退消息',
                '进退应矩', '进退有常',
                '进退有度', '进退有节', '进退裕如', '进退中度', '进退中绳', '进退迍邅', '进贤拔能', '进贤黜恶',
                '进贤黜奸', '进贤黜佞',
                '进贤达能', '进贤进能', '进贤屏恶', '进贤任能', '进贤退奸', '进贤退佞', '进贤退愚', '进贤兴功',
                '进贤用能', '九鼎一丝',
                '九垓八埏', '居大不易', '居高临下', '居功自傲', '居功自满', '居停主人', '居徒四壁', '居无求安',
                '居下讪上', '居心不净',
                '居心不良', '居心何在', '居心莫测', '居心叵测', '居心险恶', '居移气，养移体', '居之不疑', '居重驭轻',
                '居轴处中',
                '借身报仇', '借尸还魂', '借尸还阳', '借事生端', '借书留真', '借水推船', '借水行舟', '借题发挥',
                '借听于聋', '借箸代筹',
                '藉草枕块', '巾国英雄', '巾帼豪杰', '巾帼奇才', '巾帼须眉', '巾帼英雄', '巾帼丈夫', '今不如昔',
                '今蝉蜕壳', '今生今世',
                '金奔巴瓶', '谨终如始', '谨终慎始', '锦簇花团', '锦花绣草', '锦囊还矢', '锦囊佳句', '锦囊佳制',
                '锦囊妙计', '锦囊妙句',
                '锦囊玉轴', '锦片前程', '锦篇绣帙', '锦屏射雀', '锦瑟华年', '锦瑟年华', '锦上添花', '锦天绣地',
                '锦团花簇', '旧雨今雨',
                '旧雨新知', '旧雨重逢', '臼杵之交', '臼头花钿', '臼头深目', '臼灶生蛙', '臼中无釜', '鲸波鳄浪',
                '鲸波怒浪', '鲸波鼍浪',
                '鲸呿鳌掷', '鲸涛鼍浪', '鲸吞蚕食', '鲸吞虎据', '鲸吞虎噬', '鲸吞蛇噬', '鲸吸牛饮', '井底蛤蟆',
                '井底捞月', '井底鸣蛙',
                '井底虾蟆', '井底银瓶', '井底之蛙', '井管拘墟', '井井有法', '井井有方', '井井有理', '井井有条',
                '井井有序', '井井有绪',
                '井臼躬操', '井臼亲操', '酒地花天', '酒逢知己千杯少', '酒酣耳热', '酒酣耳熟', '酒后茶余', '酒后失言',
                '酒后无德',
                '酒后之勇', '酒虎诗龙', '酒浇块垒', '酒浇垒块', '救灾恤患', '救灾恤邻', '举案齐眉', '举不胜举',
                '举步如飞', '举步生风',
                '举措必当', '举措不当', '举措失当', '举措有适', '举错必当', '举错动作', '举大略细', '举鼎拔山',
                '举鼎绝膑', '举世混浊',
                '举世皆知', '举世莫比', '举世闻名', '举世无比', '举世无敌', '举世无伦', '举世无双', '举世瞩目',
                '举手加额', '举手可采',
                '举手扣额', '举手投足', '举手相庆', '举手摇足', '举手之劳', '举首戴目', '举首奋臂', '举首加额',
                '举莛扣钟', '举枉措直',
                '举无遗策', '金碧辉煌', '金碧辉映', '金碧荧煌', '金篦刮目', '金璧辉煌', '金镳玉络', '金镳玉辔',
                '金波玉液', '金不换',
                '金玉其外，败絮其中', '金玉其质', '金玉之言', '金盏银台', '金章玉句', '金章紫绶', '金昭玉粹', '金针度人',
                '金针见血',
                '警心涤虑', '净几明窗', '开卷有得', '开卷有益', '开科取士', '开口见胆', '开口见喉咙', '开口见心',
                '金钗钿合',
                '金钗换酒', '金钗十二', '精力充沛', '精力过人', '精驴禽兽', '精美绝伦', '精妙绝伦', '精妙入神',
                '精明能干', '精明强干',
                '具体而微', '惊起梁尘', '惊群动众', '惊人之举', '惊肉生髀', '惊蛇入草', '惊神破胆', '惊神泣鬼',
                '惊师动众', '惊世骇目',
                '惊世骇俗', '惊世绝俗', '惊世震俗', '惊叹不已', '惊叹不止', '惊涛骇浪', '镜分鸾凤', '金钗细合',
                '金蝉脱壳', '金蝉脱殻',
                '金铛大畹', '金城千里', '金城石室', '金城汤池', '金翅擘海', '金丹换骨', '金光盖地', '金光闪闪',
                '金龟换酒', '金闺国士',
                '金闺玉堂', '金壶墨汁', '金浆玉醴', '金浆玉液', '金尽裘敝', '金尽裘弊', '金精玉液', '金箓云签',
                '金缕玉衣', '金銮宝殿',
                '金马碧鸡', '金马玉堂', '金门绣户', '金门羽客', '金迷纸碎', '金迷纸醉', '金奴银婢', '金瓯无缺',
                '金沤浮钉', '金瓶落井',
                '金铺屈曲', '金漆饭桶', '金漆马桶', '金石不渝', '金石交情', '金石可开', '金石良言', '金石丝竹',
                '金石为开', '金石之策',
                '金石之功', '金石之计', '金石之坚', '金石之交', '金石之言', '金石至交', '金童玉女', '金头银面',
                '金丸使者', '金乌玉兔',
                '金屋藏娇', '金屋娇娘', '金屋之选', '金屋贮娇', '金无足赤', '金无足赤，人无完人', '金吾不禁', '金相玉式',
                '金相玉映',
                '金相玉振', '金相玉质', '金镶玉裹', '金星地鳝', '金星礜石', '金墟福地', '金牙铁齿', '金叶表文',
                '金叶子格', '金印如斗',
                '金印系肘', '金印紫绶', '金友玉昆', '金玉货赂', '金玉锦绣', '金玉良言', '金玉良缘', '金玉满堂',
                '金枝花萼', '金枝玉叶',
                '金鳷擘海', '金装玉裹', '矜功不立', '矜功伐能', '矜功伐善', '矜功负气', '矜功负胜', '矜功恃宠',
                '矜功自伐', '矜己任智',
                '矜己自饰', '矜矜业业', '矜矜战战', '矜纠收缭', '矜句饰字', '矜夸凌上', '矜名妒能', '矜名嫉能',
                '矜能负才', '矜贫救厄',
                '矜贫恤独', '矜平躁释', '矜奇立异', '矜奇炫博', '矜情作态', '紧要关头', '紧追不舍', '谨本详始',
                '孔孟之道', '孔情周思',
                '累足成步', '擂鼓鸣金', '擂鼓鸣锣', '擂鼓筛锣', '克己奉公', '克己复礼', '克己慎行', '克肩一心',
                '克俭克勤', '刻苦耐劳',
                '刻苦钻研', '刻木为鹄', '刻木为吏', '刻雾裁风', '刻意经营', '刻意求工', '刻章琢句', '橘化为枳',
                '精疲力竭', '精疲力尽',
                '精疲力倦', '精奇古怪', '精气神儿', '精强力壮', '精禽填海', '精锐之师', '精神百倍', '精神抖擞',
                '精神涣散', '精神焕发',
                '精神恍忽', '谨小慎微', '谨谢不敏', '谨行俭用', '谨言慎行', '锦心绣肠', '锦心绣腹', '锦心绣口',
                '锦胸绣口', '锦绣肝肠',
                '锦绣河山', '锦绣江山', '锦绣前程', '锦绣山河', '锦绣心肠', '锦衣肉食', '锦衣纨裤', '锦衣行昼',
                '锦衣玉带', '锦衣玉食',
                '锦营花阵', '锦阵花营', '锦字回文', '近不逼同', '近光镜子', '近火先焦', '近交远攻', '进谗害贤',
                '进寸退尺', '进道若蜷',
                '进道若踡', '进道若退']

    slow_print('****成语填空游戏****\n')
    while True:
        print('1.低等\n2.中等\n3.高等')
        shuru = input('请选择难度,输入数字或文字,输入q退出:')
        if shuru == 'q':
            print('已退出')
            break
        is_dideng = shuru == '1' or shuru == '低等'
        is_zhong_deng = shuru == '2' or shuru == '中等'
        is_gao_deng = shuru == '3' or shuru == '高等'
        if not is_dideng and not is_zhong_deng and not is_gao_deng:
            print(shuru, '是一个无效的字符,请重新选择难度!\n')
            continue
        e = 1
        while True:
            nandu = '低'
            if is_zhong_deng:
                nandu = '中'
            elif is_gao_deng:
                nandu = '高'
            print('下一局是{}等难度第 {} 局'.format(nandu, e))
            huoqu = input('是否前往？输入其他字符前往，输入0退出:')
            if huoqu == '0':
                break

            n = 1
            score = 0
            while n <= 10:
                print('\n--------------------第 {} 关--------------------'.format(n))
                ret_list = []
                input_list = []
                new = ""
                if is_dideng:
                    new = huoqu_new_dideng(src_list, ret_list)
                elif is_zhong_deng:
                    new = huoqu_new_zhongdeng(src_list, ret_list)
                elif is_gao_deng:
                    new = huoqu_new_gaodeng(src_list, ret_list)
                print(new)
                is_break = False
                for k, v in enumerate(ret_list, start=1):
                    white = input('请填写第' + str(k) + '个括号(只填括号里的字, 输入q退出):')
                    if white == 'q':
                        is_break = True
                        break
                    input_list.append(white)
                if is_break:
                    break
                if input_list == ret_list:
                    print('\n**********此关顺利通过**********\n')
                    score = score + 10
                else:
                    print('\n**********未过关**********\n')
                    for k, i in enumerate(ret_list, start=1):
                        print('第' + str(k) + '个括号的正确答案为:' + i)
                n = n + 1
            print('最终得分为: ', score, '分,现在,新的一局要开始了')
            e = e + 1


if __name__ == '__main__':
    cheng_yu_tian_kong()
